Advanced Programming In Class Assignment 2

In [2]:
import matplotlib as plt
import pandas as pd

1. Loading the data

In [3]:
path = '/Users/owenguglielmino/Documents/AdvancedProgramming/OIM_7502/Wage.csv'
df = pd.read_csv(path)

2-3. Display first and last 10 rows

In [4]:
df.head(10)
df.tail(10)

,year,age,maritl,race,education,region,jobclass,health,health_ins,logwage,wage
2990,2009,50,2. Married,2. Black,2. HS Grad,2. Middle Atlantic,1. Industrial,2. >=Very Good,2. No,4.886491,132.487821
2991,2003,26,1. Never Married,2. Black,3. Some College,2. Middle Atlantic,1. Industrial,2. >=Very Good,2. No,4.778151,118.884359
2992,2007,35,2. Married,1. White,1. < HS Grad,2. Middle Atlantic,1. Industrial,1. <=Good,2. No,4.698970,109.833986
2993,2006,31,2. Married,1. White,2. HS Grad,2. Middle Atlantic,2. Information,2. >=Very Good,1. Yes,4.633468,102.870247
2994,2009,31,2. Married,1. White,4. College Grad,2. Middle Atlantic,2. Information,2. >=Very Good,1. Yes,4.893207,133.380608
2995,2008,44,2. Married,1. White,3. Some College,2. Middle Atlantic,1. Industrial,2. >=Very Good,1. Yes,5.041393,154.685293
2996,2007,30,2. Married,1. White,2. HS Grad,2. Middle Atlantic,1. Industrial,2. >=Very Good,2. No,4.602060,99.689464
2997,2005,27,2. Married,2. Black,1. < HS Grad,2. Middle Atlantic,1. Industrial,1. <=Good,2. No,4.193125,66.229408
2998,2005,27,1. Never Married,1. White,3. Some College,2. Middle Atlantic,1. Industrial,2. >=Very Good,1. Yes,4.477121,87.981033
2999,2009,55,5. Separated,1. White,2. HS Grad,2. Middle Atlantic,1. Industrial,1. <=Good,1. Yes,4.505150,90.481913

4. How many rows are in the df?

In [5]:
len(df)

3000

5. Display metadata for the df

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        3000 non-null   int64
 1   age         3000 non-null   int64
 2   maritl      3000 non-null   object
 3   race        3000 non-null   object
 4   education   3000 non-null   object
 5   region      3000 non-null   object
 6   jobclass    3000 non-null   object
 7   health      3000 non-null   object
 8   health_ins  3000 non-null   object
 9   logwage     3000 non-null   float64
 10  wage        3000 non-null   float64
dtypes: float64(2), int64(2), object(7)
memory usage: 257.9+ KB

6. Display datatypes for two columns

In [7]:
df.dtypes['year']
df.dtypes['region']

dtype('O')

7. Display column names

In [8]:
df.columns

Index(['year', 'age', 'maritl', 'race', 'education', 'region', 'jobclass',
       'health', 'health_ins', 'logwage', 'wage'],
      dtype='object')

8. Display the dataframe's index

In [9]:
df.index

RangeIndex(start=0, stop=3000, step=1)

9-10. How many individual elements are in the df? How many rows and columns?
There are 33,000 elements, 3000 rows, and 11 columns.

In [15]:
df.count

<bound method DataFrame.count of       year  age            maritl      race        education  \
0     2006   18  1. Never Married  1. White     1. < HS Grad
1     2004   24  1. Never Married  1. White  4. College Grad
2     2003   45        2. Married  1. White  3. Some College
3     2003   43        2. Married  3. Asian  4. College Grad
4     2005   50       4. Divorced  1. White       2. HS Grad
...    ...  ...               ...       ...              ...
2995  2008   44        2. Married  1. White  3. Some College
2996  2007   30        2. Married  1. White       2. HS Grad
2997  2005   27        2. Married  2. Black     1. < HS Grad
2998  2005   27  1. Never Married  1. White  3. Some College
2999  2009   55      5. Separated  1. White       2. HS Grad

                  region        jobclass          health health_ins   logwage  \
0     2. Middle Atlantic   1. Industrial       1. <=Good      2. No  4.318063
1     2. Middle Atlantic  2. Information  2. >=Very Good      2. No  4.255273
2     2. Middle Atlantic   1. Industrial       1. <=Good     1. Yes  4.875061
3     2. Middle Atlantic  2. Information  2. >=Very Good     1. Yes  5.041393
4     2. Middle Atlantic  2. Information       1. <=Good     1. Yes  4.318063
...                  ...             ...             ...        ...       ...
2995  2. Middle Atlantic   1. Industrial  2. >=Very Good     1. Yes  5.041393
2996  2. Middle Atlantic   1. Industrial  2. >=Very Good      2. No  4.602060
2997  2. Middle Atlantic   1. Industrial       1. <=Good      2. No  4.193125
2998  2. Middle Atlantic   1. Industrial  2. >=Very Good     1. Yes  4.477121
2999  2. Middle Atlantic   1. Industrial       1. <=Good     1. Yes  4.505150

            wage
0      75.043154
1      70.476020
2     130.982177
3     154.685293
4      75.043154
...          ...
2995  154.685293
2996   99.689464
2997   66.229408
2998   87.981033
2999   90.481913

[3000 rows x 11 columns]>

11. Descriptive statistics for wage and age columns

In [16]:
df.wage.describe()

count    3000.000000
mean      111.703608
std        41.728595
min        20.085537
25%        85.383940
50%       104.921507
75%       128.680488
max       318.342430
Name: wage, dtype: float64

In [17]:
df.age.describe()

count    3000.000000
mean       42.414667
std        11.542406
min        18.000000
25%        33.750000
50%        42.000000
75%        51.000000
max        80.000000
Name: age, dtype: float64

12. Display descriptive statistics of wage and age by race.

In [23]:
subset = df.groupby('race')
subset.wage.describe()

,count,mean,std,min,25%,50%,75%,max
race,,,,,,,,
1. White,2480.0,112.563666,41.733830,20.085537,86.695155,106.348256,130.042934,314.329336
2. Black,293.0,101.601177,37.162486,23.274704,81.283253,94.072715,117.146817,318.342430
3. Asian,190.0,120.288288,46.422514,34.607418,87.981033,115.375039,144.828129,299.262977
4. Other,37.0,89.973326,29.153530,38.223583,71.319639,81.283253,104.921507,169.528538

In [24]:
subset.age.describe()

           count       mean        std   min    25%   50%   75%   max
race
1. White  2480.0  42.394758  11.365655  18.0  34.00  42.0  51.0  80.0
2. Black   293.0  43.563140  13.012913  18.0  33.00  44.0  52.0  75.0
3. Asian   190.0  41.821053  11.218823  22.0  32.25  40.0  50.0  76.0
4. Other    37.0  37.702703  11.553895  21.0  28.00  39.0  47.0  65.0

13. What do the mean and median values for wage tell us about the data?
I would assume that based on the values in the wage column, these are yearly wages reported in thousands of dollars.

14. Display wage and age columns only.

In [27]:
df[['age', 'wage']]

      age        wage
0      18   75.043154
1      24   70.476020
2      45  130.982177
3      43  154.685293
4      50   75.043154
...   ...         ...
2995   44  154.685293
2996   30   99.689464
2997   27   66.229408
2998   27   87.981033
2999   55   90.481913

[3000 rows x 2 columns]

15. Are these columns correlated?
Based on the results of the .corr() function, we can see that these columns have a slight positive correlation.

In [29]:
df[['age', 'wage']].corr()

           age      wage
age   1.000000  0.195637
wage  0.195637  1.000000

16. Display the top 10 salaries

In [30]:
df.wage.nlargest(10)

206     318.342430
1229    318.342430
503     314.329336
1293    311.934569
1112    309.571771
2712    309.571771
2893    299.262977
2925    295.991250
489     284.524741
347     281.745971
Name: wage, dtype: float64

17. Display the counts of each race

In [31]:
df.race.value_counts()

1. White    2480
2. Black     293
3. Asian     190
4. Other      37
Name: race, dtype: int64

18. Display the proportion of each race in the dataset

In [32]:
df.race.value_counts(normalize=True)

1. White    0.826667
2. Black    0.097667
3. Asian    0.063333
4. Other    0.012333
Name: race, dtype: float64

19. Create a barplot of regional proportionality

I'm not sure what to do here, as the data set appears to only have Middle Atlantic in the region column. As such, the barplot would be one bar, middle atlantic, with a value

In [35]:
df.region.unique()

array(['2. Middle Atlantic'], dtype=object)